from r import r_get

std_tubes_dict1 = {
15 : (15,18,14,2),
20 : (20,25,21,2),
25 : (25,32,27,2.5),
32 : (32,38,33,2.5),
40 : (40,45,40,2.5),
50 : (50,57,50,3.5),
70 : (70,76,69,3.5),
80 : (80,89,82,3.5),
100 : (100,108,100,4),
125 : (125,133,125,4),
150 : (150,159,150,4.5),
175 : (175,194,184,5),
200 : (200,219,207,6),
250 : (250,273,259,7),
300 : (300,325,309,8),
350 : (350,377,359,9),
350 : (350,377,357,10),
400 : (400,426,414,6),
400 : (400,426,408,9.9),
450 : (450,480,468,6),
450 : (450,480,466,8),
500 : (500,529,517,6),
500 : (500,529,515,7),
600 : (600,630,616,7),
600 : (600,630,614,8),
700 : (700,720,706,7),
700 : (700,720,704,8),
700 : (700,720,702,9),
800 : (800,820,804,8),
900 : (900,920,902,9),
1000 : (1000,1020,1000,10),
1200 : (1200,1220,1198,11),
1200 : (1200,1220,1192,14),
1400 : (1400,1420,1398,11),
1400 : (1400,1420,1392,14),
}


std_tubes_dict1_int = {
    18 : (15,14,18,2),
    25 : (20,21,25,2),
    26 : (25,32,26,3),
    28 : (25,32,28,2),
    32 : (32,38,32,3),

    33 : (32,38,33,2.5),
    
    34 : (32,38,34,2),
    39 : (40,45,39,3),
    41 : (40,45,41,2),
    51 : (50,57,51,3),

    65 : (65,70,76,3),
    
    70 : (65,76,70,3),
    82 : (80,89,82,3),
    100 : (100,108,100,4),
    125 : (125,133,125,4),
    150 : (150,159,150,4),
    184 : (175,194,184,5),
    207 : (200,219,207,6),
    211 : (200,219,211,4),
    259 : (250,273,259,7),
    263 : (250,273,263,5),
    309 : (300,325,309,8),
    315 : (300,325,315,5),
    359 : (350,377,359,9),
    367 : (350,377,367,5),
    408 : (400,426,408,9),
    414 : (400,426,414,6),
    512 : (500,530,512,9),
    518 : (500,530,518,6),
    610 : (600,630,610,10),

    514 : (500,530,512,9),
    612 : (600,630,610,10),


    618 : (600,630,618,6),
    698 : (700,720,698,11),
    706 : (700,720,706,7),
    796 : (800,820,796,12),
    806 : (800,820,806,7),
    892 : (900,920,892,14),
    904 : (900,920,904,8),
    990 : (1000,1020,990,15),
    1004 : (1000,1020,1004,8),
    1188 : (1200,1220,1188,16),
    1204 : (1200,1220,1204,8),
    1388 : (1400,1420,1388,16),
    1400 : (1400,1420,1400,10),
}

'''
               15 : (15,18,14,2),
               20 : (20,25,21,2),
               25 : (25,26,32,3),
               25 : (25,28,32,2),
               32 : (32,32,38,3),
               32 : (32,34,38,2),
               40 : (40,39,45,3),
               40 : (40,41,45,2),
               50 : (50,51,57,3),
               65 : (65,70,76,3),
               80 : (80,82,89,3),
               100 : (100,100,108,4),
               125 : (125,125,133,4),
               150 : (150,150,159,4),
               175 : (175,184,194,5),
               200 : (200,207,219,6),
               200 : (200,211,219,4),
               250 : (250,259,273,7),
               250 : (250,263,273,5),
               300 : (300,309,325,8),
               300 : (300,315,325,5),
               350 : (350,359,377,9),
               350 : (350,367,377,5),
               400 : (400,408,426,9),
               400 : (400,414,426,6),
               500 : (500,512,530,9),
               500 : (500,518,530,6),
               600 : (600,610,630,10),
               600 : (600,618,630,6),
               700 : (700,698,720,11),
               700 : (700,706,720,7),
               800 : (800,796,820,12),
               800 : (800,806,820,7),
               900 : (900,892,920,14),
               900 : (900,904,920,8),
               1000 : (1000,990,1020,15),
               1000 : (1000,1004,1020,8),
               1200 : (1200,1188,1220,16),
               1200 : (1200,1204,1220,8),
               1400 : (1400,1388,1420,16),
               1400 : (1400,1400,1420,10),

'''

'''

14 : (15,18,14,2),
21 : (20,25,21,2),
27 : (25,32,27,2.5),
33 : (32,38,33,2.5),
40 : (40,45,40,2.5),
50 : (50,57,50,3.5),
69 : (70,76,69,3.5),
82 : (80,89,82,3.5),
100 : (100,108,100,4),
125 : (125,133,125,4),
150 : (150,159,150,4.5),
184 : (175,194,184,5),
207 : (200,219,207,6),
259 : (250,273,259,7),
309 : (300,325,309,8),
359 : (350,377,359,9),
357 : (350,377,357,10),
414 : (400,426,414,6),
408 : (400,426,408,9.9),
468 : (450,480,468,6),
466 : (450,480,466,8),
517 : (500,529,517,6),
515 : (500,529,515,7),
616 : (600,630,616,7),
614 : (600,630,614,8),
706 : (700,720,706,7),
704 : (700,720,704,8),
702 : (700,720,702,9),
804 : (800,820,804,8),
902 : (900,920,902,9),
1000 : (1000,1020,1000,10),
1198 : (1200,1220,1198,11),
1192 : (1200,1220,1192,14),
1398 : (1400,1420,1398,11),
1392 : (1400,1420,1392,14),
'''




'''
  25 : (25,32,26,3),
  25 : (25,32,28,2),
  32 : (32,38,32,3),
#  32 : (32,38,34,2),
  40 : (40,45,39,3),
  40 : (40,45,41,2),
  50 : (50,57,51,3),
  65 : (65,76,70,3),
  70 : (65,76,70,3),
  80 : (80,89,82,3),
  100 : (100,108,100,4),
  125 : (125,133,125,4),
  150 : (150,159,150,4),
  175 : (175,194,184,5),
  200 : (200,219,207,6),
  200 : (200,219,211,4),
  250 : (250,273,259,7),
  250 : (250,273,263,5),
  300 : (300,325,309,8),
  300 : (300,325,315,5),
  350 : (350,377,359,9),
  350 : (350,377,367,5),
  400 : (400,426,408,9),
  400 : (400,426,414,6),
  500 : (500,530,512,9),
  500 : (500,530,518,6),
  600 : (600,630,610,10),
  600 : (600,630,618,6),
  700 : (700,720,698,11),
  700 : (700,720,706,7),
  800 : (800,820,796,12),
  800 : (800,820,806,7),
  900 : (900,920,892,14),
  900 : (900,920,904,8),
  1000 : (1000,1020,990,15),
  1000 : (1000,1020,1004,8),
  1200 : (1200,1220,1188,16),
  1200 : (1200,1220,1204,8),
  1400 : (1400,1420,1388,16),
  1400 : (1400,1420,1400,10),
  }
'''


std_tubes_dict2 = {
  20   : (20,26.9,21.7,2.6),
  25   : (25,33.7,21.7,2.6),
  32   : (32,42.4,21.7,2.6),
  40   : (40,48.3,21.7,2.6),
  50   : (50,60.3,54.5,2.9),
  65   : (65,76.1,70.3,2.9),
  80   : (80,88.9,82.5,3.2),
  100  : (100,114.3,107.1,3.6),
  125  : (125,139.7,132.5,3.6),
  150  : (150,168.3,160.3,4),
  200  : (200,219.1,210.1,4.5),
  250  : (250,273,263,5),
  300  : (300,323.9,312.7,5.6),
  350  : (350,355.6,344.4,5.6),
  400  : (400,406.4,393.8,6.3),
  450  : (450,457.2,444.6,6.3),
  500  : (500,508,495.4,6.3),
  550  : (550,558.8,546.2,6.3),
  600  : (600,609.6,593.6,8),
  700  : (700,711,695,8),
  800  : (800,813,795.4,8.8),
  900  : (900,914,894,10),
  1000 : (1000,1016,996,10),
  1100 : (1100,1118,1096,11),
  }

set_diam = set()


def read_tube(r, regim, id_new):
    L = r_get(r, 'L', 0)
    Dpod = r_get(r, 'Dpod', 0)*1000
    Dobr = r_get(r, 'Dobr', 0)*1000

    Zpod = r_get(r, 'Zpod', 0)    # сумма коэффициентов местных сопротивлений подающего трубопровода
    Zobr = r_get(r, 'Zobr', 0)

    Ke_pod = r_get(r, 'Ke_pod', 0)   # Шероховатость подающего трубопровода, мм
    Ke_obr = r_get(r, 'Ke_obr', 0)
    
    Kz_pod = r_get(r, 'Kz_pod', 0)   # Коэффициент местного сопротивления 
    Kz_obr = r_get(r, 'Kz_obr', 0)
    
    Zarost_pod = r_get(r, 'Zarost_pod', 0)
    Zarost_obr = r_get(r, 'Zarost_obr', 0)

    ex = False

    if Dpod != Dobr:
        print(f'====D {Dpod} {Dobr}')
        ex = True

    if Zpod != Zobr:
        print(f'==== Z {Zpod} {Zobr}')
        ex = True

    if Ke_pod != Ke_pod:
        print(f'==== Ke {Ke_pod} {Ke_pod}')
        ex = True

    if Kz_pod != Kz_pod:
        print(f'==== Kz {Kz_pod} {Kz_pod}')
        ex = True

    if Zarost_pod != Zarost_pod:
        print(f'==== Zarost {Zarost_pod} {Zarost_pod}')
        ex = True

#    if ex:
#        exit(0)


#    Kz_pod = 0

    Proklad = {1:4,2:1,3:2,4:3}.get(r_get(r, 'Proklad', 0), 1)

    if Ke_pod == 0: Ke_pod = 0.5
    if Ke_obr == 0: Ke_pod = 0.5

#    print('Dpod', Dpod, 'Dobr', Dobr)

    pipeSectStateIDflow = 2 if regim in [1, 3] else 1
    pipeSectStateIDret = 2 if regim in [1, 2] else 1

#    print('regim=', regim)

    if regim in [5, 6, 8]:
        pipeSectStateIDflow = 2
        pipeSectStateIDret = 2
    
    if Dpod == 0 : 
        Dpod = Dobr
        pipeSectStateIDflow = 2

    if Dobr == 0 : 
        Dobr = Dpod
        pipeSectStateIDret = 2

    if Dpod == 0 and Dobr == 0: 
        Dpod = 200
        Dobr = 200
     

    if L == 0 : L = 1

    Wizol_pod = r_get(r, 'Wizol_pod', 0)   # Толщина изоляции подающего трубопровод
    Wizol_obr = r_get(r, 'Wizol_obr', 0)

    S = r_get(r, 'S', 0)

    Hkanal = r_get(r, 'Hkanal', 0)  #  Высота канала, м
    Wkanal = r_get(r, 'Wkanal', 0)  #  Ширина канала, м

    Hzal = r_get(r, 'Hzal', 0)  # Глубина заложения трубопровода, м

    (diameterCondit, diameterExternal, diameterInternal, wallThickness) = std_tubes_dict1.get(Dpod, (Dpod, Dpod, Dpod, 0))

    if wallThickness == 0:
        (diameterCondit, diameterExternal, diameterInternal, wallThickness) = std_tubes_dict1_int.get(Dpod, (Dpod, Dpod, Dpod, 0))

    if wallThickness == 0:
        if not Dpod in set_diam:
            print("Неизвестный диаметр", Dpod)
            set_diam.add(Dpod)

#        exit(0)

    diameterInternal = Dpod-Zarost_pod*2

    signNumWork = 1 # работает < 5000
    signNumWork = 1 # работает > 5000

    Norma = r_get(r, 'Norma', 3)

    year_norm = {1:1959,2:1988,3:1997,4:2003,5:2004}.get(Norma, 1997)
    
    lastTransDate = f'{year_norm}0101'

    DolyaP = Kz_pod-1   # Доля местных потерь

    if DolyaP < 0: DolyaP = 0

    mestn = Zpod

#    insert = f'''INSERT INTO [heatPipeSections] (pipeSectStateIDflow,pipeSectStateIDret, lineID, pipeSectLength, diameterCondit, diameterExternal, diameterInternal, wallThickness, tubeRoughness, tubingTypeID, localResSum, localLosesShare, isolThickness, pipelineAxesDist, constrChanHeight, constrChanWidth, pipelineLayingDepth, signNumWork, lastTransDate) 
#             VALUES ({pipeSectStateIDflow}, {pipeSectStateIDret}, {id_new}, {L}, {diameterCondit}, {diameterExternal}, {diameterInternal}, {wallThickness}, {Ke_pod}, {Proklad}, {DolyaP}, {0}, {Wizol_pod}, {S}, {Hkanal}, {Wkanal}, {Hzal}, {signNumWork}, '{lastTransDate}')'''

    insert = f'''INSERT INTO [heatPipeSections] 
                (pipeSectStateIDflow,pipeSectStateIDret, lineID, pipeSectLength, 
                    diameterCondit, diameterExternal, diameterInternal, wallThickness, 
                    tubeRoughness, tubingTypeID, localResSum, localLosesShare, 
                    isolThickness, pipelineAxesDist, constrChanHeight, constrChanWidth, 
                    pipelineLayingDepth, signNumWork, lastTransDate) 

             VALUES ({pipeSectStateIDflow}, {pipeSectStateIDret}, {id_new}, {L}, 
               {diameterCondit}, {diameterExternal}, {diameterInternal}, {wallThickness}, 
               {Ke_pod}, {Proklad}, {mestn}, {DolyaP}, 
               {Wizol_pod}, {S}, {Hkanal}, {Wkanal}, 
               {Hzal}, {signNumWork}, '{lastTransDate}')'''

    
    return insert