#-------------------------------------------------
'''
Для отладки

''' 
#-------------------------------------------------

#-----------------------------------------------------------------------------------

def get_tr0():
    tr = {}

#  "calcTemperatureID","Код расчетных температур"
    
    tr['Tx'] = 5                  #  "Расч.температура холодной водопр.воды, °C"
    tr['Tn_r'] = -32 #35              #  "Расчетная температура наружного воздуха для отопления, °C"
    tr['Tn_r_v'] = -35            #  "Расч.температура наружного воздуха для вентиляции и воздушной СО, °C"
    tr['tn_isl'] = 2.5            #  "Температура наружного воздуха излома темп.графика, °C"
                                  
    tr['T1_isl_2stup'] = 70       #  "Расч.температура сетевой воды на входе ТП в т.изл.темп. граф., °C"
                                  
    tr['Tr_co_1_zco'] = 150 #130       #  "Расч.температура воды в подающем трубопроводе, зав.СО, °C"  
    tr['Tr_co_2_zco'] = 70        #  "Расч.температура воды в обратном трубопроводе, зав.СО, °C"  
    tr['Tr_co_3_zco'] = 95        #  "Расч.температура воды после узла смешения зав.СО, °C"       
                                  
    tr['Tr_to_1_nco'] = 150 #130       #  "Расчетная температура сетевой воды на входе подогревателя, незав.СО, °C"     
    tr['Tr_to_2_nco'] = 80 #70        #  "Расч.температура сетевой воды на выходе подогревателя, незав.СО, °C"         
    tr['Tr_co_1m_nco'] = 140 # 130      #  "Расч.температура воды в подающем трубопроводе местной СО незав.СО, °C"                                                                                                     
    tr['Tr_co_2m_nco'] = 70       #  "Расч.температура воды в обратном трубопроводе местной СО незав.СО, °C"      
    tr['Tr_co_3m_nco'] = 95       #  "Расч.температура воды после узла смешения местной СО незав.СО, °C"          
                                  
    tr['Tr_1_cv'] = 130           #  "Расч.темп. сет.воды на входе вентиляции или воздушной системы отопления, °C"                                   
    tr['Tr_2_cv'] = 70            #  "Расч.темп. сет.воды на выходе вентиляции или воздушной системы отопления, °C"                                  

    tr['Tr_co_1_zco_pr'] = 130    #  "Расч.температура воды в подающем трубопроводе зав.СО, парал.ГВС, °C" 
    tr['Tr_co_2_zco_pr'] = 70     #  "Расч.температура воды в обратном трубопроводе зав.СО парал.ГВС, °C"  
    tr['Tr_co_3_zco_pr'] = 95     #  "Расч.температура воды после узла смешения зав.СО парал.ГВС, °C"      
    tr['Tr_to_1_pr'] = 130        #  "Расч.температура сетевой воды на входе подогревателя, незав.СО парал.ГВС, °C"                          
    tr['Tr_to_2_pr'] = 70         #  "Расчетная температура сетевой воды на выходе подогревателя, независимой СО парал.ГВС, °C"              
    tr['Tr_co_1m_nco_pr'] = 130   #  "Расчетная температура воды в подающем трубопроводе местной СО независимая СО парал.ГВС, °C"       
    tr['Tr_co_2m_nco_pr'] = 70    #  "Расч.температура воды в обратном трубопроводе местной СО незав.СО парал.ГВС, °C"                  
    tr['Tr_co_3m_nco_pr'] = 95    #  "Расч.температура воды после узла смешения местной СО незав.СО парал.ГВС, °C"                      
    tr['T2_isl_2stup_pr'] = 30    #  "Температура сетевой воды на выходе 2 ступени подогревателя т.изл.темп. граф., парал.ГВС, °C"      
    
    tr['Tr_co_1_zco_sm'] = 130    #  "Расч.температура воды в подающем трубопроводе, зав.СО смеш.ГВС, °C"                      
    tr['Tr_co_2_zco_sm'] = 70     #  "Расч.температура воды в обратном трубопроводе, зав.СО, смеш.ГВС, °C"                     
    tr['Tr_co_3_zco_sm'] = 95     #  "Расч.температура воды после узла смешения зав.СО смеш.ГВС, °C"                           
    tr['Tr_to_1_sm'] = 130        #  "Расч.температура сетевой воды на входе подогревателя, незав.СО смеш.ГВС, °C"                 
    tr['Tr_to_2_sm'] = 70         #  "Расч.температура сетевой воды на выходе подогревателя незав.СО смеш.ГВС, °C"                 
    tr['Tr_co_1m_nco_sm'] = 130   #  "Расч.температура воды в подающем трубопроводе местной СО незав.СО смеш.ГВС, °C"         
    tr['Tr_co_2m_nco_sm'] = 70    #  "Расч.температура воды в обратном трубопроводе местной СО незав.СО смеш.ГВС, °C"         
    tr['Tr_co_3m_nco_sm'] = 70    #  "Расч.температура воды после узла смешения местной СО, незав.СО смеш.ГВС, °C"            
    tr['T2_isl_2stup_sm'] = 41.7  #  "Температура сетевой воды на выходе СО в т.изл.темп. граф. смеш.ГВС, °C"                 
    tr['delta_tg_sm'] = 5         #  "Недогрев водопроводной воды в 1 ступени ГВС до обратной СО в т.изл.темп.граф смеш.ГВС, °C"  
    
    tr['Tr_co_1_zco_ps'] = 130    #  "Расч.температура воды в подающем трубопроводе зав.СО посл.ГВС, °C"                       
    tr['Tr_co_2_zco_ps'] = 70     #  "Расч.температура воды в обратном трубопроводе зав.СО посл.ГВС, °C"                       
    tr['Tr_co_3_zco_ps'] = 95     #  "Расч.температура воды после узла смешения зав.СО посл.ГВС, °C"                           
    tr['Tr_to_1_ps'] = 130        #  "Расч.температура сетевой воды на входе подогревателя незав.СО посл.ГВС, °C"                  
    tr['Tr_to_2_ps'] = 70         #  "Расчетная температура сетевой воды на выходе подогревателя незав.СО посл.ГВС, °C"            
    tr['Tr_co_1m_nco_ps'] = 130   #  "Расчетная температура воды в подающем трубопроводе местной СО незав.СО посл.ГВС, °C"    
    tr['Tr_co_2m_nco_ps'] = 70    #  "Расчетная температура воды в обратном трубопроводе местной СО незав.СО посл.ГВС, °C"    
    tr['Tr_co_3m_nco_ps'] = 95    #  "Расчетная температура воды после узла смешения местной СО незав.СО, посл.ГВС, °C"       
    tr['T2_isl_2stup_ps'] = 41.7  #  "Температура сетевой воды на выходе СО в т.изл.темп. граф.посл.ГВС, °C"                  
    tr['delta_tg_ps'] = 5         #  "Недогрев водопроводной воды в 1 ступени ГВС до обратной СО в т.изл.темп. граф.посл. ГВС, °C"

    tr['Tr_co_1_zco_pw'] = 130    #  "Расч.температура воды в подающем трубопроводе зав.СО предвкл.ГВС, °C"                       
    tr['Tr_co_2_zco_pw'] = 70     #  "Расч.температура воды в обратном трубопроводе зав.СО предвкл.ГВС, °C"                       
    tr['Tr_co_3_zco_pw'] = 95     #  "Расч.температура воды после узла смешения зав.СО предвкл.ГВС, °C"                           
    tr['Tr_to_1_pw'] = 130        #  "Расч.температура сетевой воды на входе подогревателя незав.СО предвкл.ГВС, °C"                  
    tr['Tr_to_2_pw'] = 70         #  "Расчетная температура сетевой воды на выходе подогревателя незав.СО предвкл.ГВС, °C"            
    tr['Tr_co_1m_nco_pw'] = 130   #  "Расчетная температура воды в подающем трубопроводе местной СО незав.СО предвкл.ГВС, °C"    
    tr['Tr_co_2m_nco_pw'] = 70    #  "Расчетная температура воды в обратном трубопроводе местной СО незав.СО предвкл.ГВС, °C"    
    tr['Tr_co_3m_nco_pw'] = 95    #  "Расчетная температура воды после узла смешения местной СО незав.СО, предвкл.ГВС, °C"       
    tr['T2_isl_2stup_pw'] = 41.7  #  "Температура сетевой воды на выходе СО в т.изл.темп. граф.предвкл.ГВС, °C"                  

    return tr                            
                                         
#-----------------------------------------------------------------------------------

def get_pr0(type_gv, gv):
    pr = {}

    pr['uf'] = 0
    pr['uf'] = 2.2
    pr['otoplz'] = 0
    pr['otopln'] = 1

    pr['gvsm'] = 0
    pr['gvps'] = 0
    pr['gvpw'] = 0
    pr['gvpr'] = 0
    pr['gvop'] = 0
    pr['gvoo'] = 0

    pr[type_gv] = gv

    pr['Tr_tv_co'] = 18 # Температура внутри помещения расчетная
#    po['Tr_tv_co_zco'] = 18 # Температура внутри помещения расчетная
#    po['Tr_tv_co_nco'] = 18 # Температура внутри помещения расчетная

    pr['Tr_gvs'] = 60

    pr['gvs_max'] = 1.2

    return pr

#-----------------------------------------------------------------------------------

def get_ct():
    ct = {}
    ct['t_or'] = -32.
    ct['t_vr'] = -32.

    return ct

#-----------------------------------------------------------------------------------

def get_ur0():
    ur = {}

    ur['otoplz'] = 12.5
    ur['otopln'] = 14.3
    ur['ventil'] = 12.5
    ur['kondiz'] = 12.5
    ur['txz'] = 12.5
    ur['txo'] = 18.2
    ur['gvo'] = 18.2
    ur['rez'] = 66.7
    ur['gvpr'] = 28.75
    ur['gvsm'] = 16.6
    ur['gvps'] = 18.7
    ur['gvpw'] = 44.1
    ur['gvz_leto'] = 25
    ur['gvo_leto'] = 15.4

    return ur

#-----------------------------------------------------------------------------------
