import math

#-----------------------------------------------------------------------------------
# Среднее логарифмическое

# [Claude 2026-10-18] Среднелогарифмическая разность t1, t2; при неположительных значениях - среднее арифметическое.
def srlog(t1: float, t2: float) -> float:
    if t1 <= 0 or t2 <= 0: 
        return (t1 + t2) / 2
    if t1 == t2:
        return t1

    return (t1 - t2) / math.log(t1 / t2)

#-----------------------------------------------------------------------------------
